docs/load-test-2026-08-19-websocket-heartbeat/k6-summary-after-heartbeat-run2.txt
    checks_total.......: 800     30.24064/s
    checks_succeeded...: 100.00% 800 out of 800
    checks_failed......: 0.00%   0 out of 800

    ✓ login: status is 200
    ✓ login: accessToken exists
    ✓ ws upgrade status is 101
    ✓ stomp CONNECTED received

    HTTP
    http_req_duration..............: avg=224.22ms min=83.85ms med=106.59ms max=827.9ms  p(90)=621.6ms p(95)=698.19ms
      { expected_response:true }...: avg=224.22ms min=83.85ms med=106.59ms max=827.9ms  p(90)=621.6ms p(95)=698.19ms
    http_req_failed................: 0.00%  0 out of 200
    http_reqs......................: 200    7.56016/s

    EXECUTION
    iteration_duration.............: avg=26.44s   min=26.43s  med=26.44s   max=26.45s   p(90)=26.45s  p(95)=26.45s  
    iterations.....................: 200    7.56016/s
    vus............................: 200    min=200      max=200
    vus_max........................: 200    min=200      max=200

    NETWORK
    data_received..................: 422 kB 16 kB/s
    data_sent......................: 140 kB 5.3 kB/s

    WEBSOCKET
    ws_connecting..................: avg=44.16ms  min=4.14ms  med=8.38ms   max=277.05ms p(90)=146ms   p(95)=211.31ms
    ws_msgs_received...............: 400    15.12032/s
    ws_msgs_sent...................: 200    7.56016/s
    ws_session_duration............: avg=22.77s   min=20.37s  med=22.67s   max=24.61s   p(90)=24.43s  p(95)=24.54s  
    ws_sessions....................: 200    7.56016/s

hold_open_connections ✓ [ 100% ] 200 VUs  0m26.5s/1m30s  200/200 iters, 1 per VU