docs/load-test-2026-08-19-websocket-heartbeat/k6-summary-before-no-heartbeat-run2.txt
    checks_total.......: 800     12.108384/s
    checks_succeeded...: 100.00% 800 out of 800
    checks_failed......: 0.00%   0 out of 800

    ✓ login: status is 200
    ✓ login: accessToken exists
    ✓ ws upgrade status is 101
    ✓ stomp CONNECTED received

    HTTP
    http_req_duration..............: avg=246.54ms min=87.63ms med=107.95ms max=862.78ms p(90)=630.31ms p(95)=754.13ms
      { expected_response:true }...: avg=246.54ms min=87.63ms med=107.95ms max=862.78ms p(90)=630.31ms p(95)=754.13ms
    http_req_failed................: 0.00%  0 out of 200
    http_reqs......................: 200    3.027096/s

    EXECUTION
    iteration_duration.............: avg=1m3s     min=1m2s    med=1m3s     max=1m6s     p(90)=1m5s     p(95)=1m5s    
    iterations.....................: 200    3.027096/s
    vus............................: 6      min=6        max=200
    vus_max........................: 200    min=200      max=200

    NETWORK
    data_received..................: 420 kB 6.4 kB/s
    data_sent......................: 141 kB 2.1 kB/s

    WEBSOCKET
    ws_connecting..................: avg=56ms     min=4.73ms  med=8.54ms   max=285.05ms p(90)=220.93ms p(95)=257.56ms
    ws_msgs_received...............: 200    3.027096/s
    ws_msgs_sent...................: 200    3.027096/s
    ws_session_duration............: avg=1m0s     min=1m0s    med=1m0s     max=1m0s     p(90)=1m0s     p(95)=1m0s    
    ws_sessions....................: 200    3.027096/s

hold_open_connections ✓ [ 100% ] 200 VUs  1m06.1s/1m30s  200/200 iters, 1 per VU